final_app/app/controllers/base_menus_controller.rb

  def create
    @base_menu = @owner.base_menus.build(base_menu_params)

    respond_to do |format|
      if @base_menu.save
---
INSERT INTO "base_menus" ("title", "description", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "new"], ["description", "add to this"], ["owner_id", 9], ["created_at", "2024-12-02 08:23:42.409959"], ["updated_at", "2024-12-02 08:23:42.409959"]]

    def get_owner
      @owner = Owner.find(params[:owner_id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def set_base_menu
      @base_menu = @owner.base_menus.find(params[:id])
---
SELECT "base_menus".* FROM "base_menus" WHERE "base_menus"."owner_id" = ? AND "base_menus"."id" = ? LIMIT ?  [["owner_id", 12], ["id", 6], ["LIMIT", 1]]