final_app/app/controllers/menu_items_controller.rb

INSERT INTO "menu_items" ("item", "description", "price", "available", "base_menu_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @menu_item = @base_menu.menu_items.build(menu_item_params)

    respond_to do |format|
      if @menu_item.save

DELETE FROM "menu_items" WHERE "menu_items"."id" = ?  [["id", 1]]
---
  def destroy
    @menu_item.destroy!

SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def get_owner
      @owner = Owner.find(params[:owner_id])

SELECT "base_menus".* FROM "base_menus" WHERE "base_menus"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def get_base_menu
      @base_menu = BaseMenu.find(params[:base_menu_id])

SELECT "base_menus".* FROM "base_menus" WHERE "base_menus"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."base_menu_id" = ? AND "menu_items"."id" = ? LIMIT ?  [["base_menu_id", 7], ["id", 1], ["LIMIT", 1]]
---
    def set_menu_item
      @menu_item = @base_menu.menu_items.find(params[:id])