final_app/app/controllers/owners_controller.rb

  def create
    @owner = Owner.new(owner_params)

    respond_to do |format|
      if @owner.save
---
INSERT INTO "owners" ("company_name", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["company_name", "Restaurant"], ["name", "Josh"], ["created_at", "2024-11-19 19:59:14.232503"], ["updated_at", "2024-11-19 19:59:14.232503"]]

  def update
    respond_to do |format|
      if @owner.update(owner_params)
---
UPDATE "owners" SET "company_name" = ?, "name" = ?, "updated_at" = ? WHERE "owners"."id" = ?  [["company_name", "Joshu"], ["name", "ye"], ["updated_at", "2024-11-20 01:15:54.044533"], ["id", 2]]

  def destroy
    @owner.destroy!
---
DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 2]]