final_app/app/views/base_menus/show.html.erb


<% if @base_menu.menu_items.any? %>
  <div class="row">
    <% @base_menu.menu_items.each do |menu_item| %>
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."base_menu_id" = ?  [["base_menu_id", 8]]
SELECT 1 AS one FROM "menu_items" WHERE "menu_items"."base_menu_id" = ? LIMIT ?  [["base_menu_id", 9], ["LIMIT", 1]]